

function [set]=ClosetPointMatch1(XP)
%*********************************************************************
%*********************************************************************
%*********************************************************************
%函数功能：寻找待匹配点集每个点的最近点（欧氏距离最小） 
%输入：1个4×1矩阵XP
%输出：1个4×1矩阵set
%其中，XP(:,i) = |xP|         set(:,i)=|xP      |
%                |yP|                  |yP      |
%                |xX|                  |xPCloset|
%                |yX|                  |yPCloset|
%其中，(xP,yP)为待匹配点集P的数据点，(xX,yX)模板点集X的数据点
%      (xXCloset,yXCloset)位于模板点集X，为(xP,yP)一一对应的最近点
%      所有点均处于笛卡尔坐标系      
%作者：Shaofeng Wu 
%时间：2017.11.26
%邮箱：shaofeng693@126.com
%*********************************************************************
%*********************************************************************
%*********************************************************************


%*********************************************************************
%*********************************************************************
%Step1：获取初始数据
xP=XP(1,:);                                                 %获取P点集所有点的横坐标                     
yP=XP(2,:);                                                 %获取P点集所有点的纵坐标   
xX=XP(3,:);                                                 %获取X点集所有点的横坐标   
yX=XP(4,:);                                                 %获取X点集所有点的纵坐标   
rangeMin=zeros(size(xP));                         %设置一个大小和xP一样的向量
rangeMin(1,:)=9000.0;                               %向量的每个元素赋初值为9000（不能太小）
rangeMinFlag=zeros(size(xP));                  %设置一个大小和xP一样的向量
set=[xP;yP;zeros(size(xP));zeros(size(xP))]; %
%*********************************************************************
%*********************************************************************
%Step2：在X点集中寻找点集P的最近点
for i=1:length(xP)
    for j=1:length(xX)                                                  %在X点集中寻找点集P的最近点
        distance=sqrt((xP(i)-xX(j))^2+(yP(i)-yX(j))^2);  %计算两点间的欧氏距离
        if distance<rangeMin(i)                                     %如果当前点的与匹配点的距离distance比rangeMin ，则更新为rangeMin 值
            rangeMin(i)=distance;
            rangeMinFlag(i)=j;                                         %得到最近点的下标   
            set(3,i)=xX(j);                                                  %更新最近点
            set(4,i)=yX(j);
        end
    end%for alphaInit
end%for alpha













